; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image5 - mode
	thermograph1 - mode
	infrared3 - mode
	infrared0 - mode
	image2 - mode
	spectrograph4 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image5)
	(supports instrument1 infrared0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 thermograph1)
	(supports instrument2 image5)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 image5)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star4)
	(supports instrument4 image5)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 spectrograph4)
	(supports instrument6 image2)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph1)
	(supports instrument7 image5)
	(supports instrument7 image2)
	(calibration_target instrument7 Star6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet7 infrared0)
	(have_image Planet7 image2)
	(have_image Planet8 image2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 thermograph1)
	(have_image Planet10 image5)
	(have_image Phenomenon11 image5)
	(have_image Star12 image2)
	(have_image Star12 thermograph1)
	(have_image Planet13 image2)
	(have_image Planet13 image5)
	(have_image Planet14 image5)
	(have_image Planet14 spectrograph4)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 14
2. (calibrate satellite2 instrument7 star6)
   added: (calibrated instrument7)
   goals met: 0 of 14
3. (turn_to satellite2 star12 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star12)
   goals met: 0 of 14
4. (take_image satellite2 star12 instrument7 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 1 of 14
5. (take_image satellite2 star12 instrument7 image2)
   added: (have_image star12 image2)
   goals met: 2 of 14
6. (turn_to satellite2 planet14 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet14)
   goals met: 2 of 14
7. (take_image satellite2 planet14 instrument7 image5)
   added: (have_image planet14 image5)
   goals met: 3 of 14
8. (turn_to satellite2 planet13 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet13)
   goals met: 3 of 14
9. (take_image satellite2 planet13 instrument7 image5)
   added: (have_image planet13 image5)
   goals met: 4 of 14
10. (take_image satellite2 planet13 instrument7 image2)
   added: (have_image planet13 image2)
   goals met: 5 of 14
11. (turn_to satellite2 planet10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet10)
   goals met: 5 of 14
12. (take_image satellite2 planet10 instrument7 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 6 of 14
13. (take_image satellite2 planet10 instrument7 image5)
   added: (have_image planet10 image5)
   goals met: 7 of 14
14. (turn_to satellite2 phenomenon11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon11)
   goals met: 7 of 14
15. (take_image satellite2 phenomenon11 instrument7 image5)
   added: (have_image phenomenon11 image5)
   goals met: 8 of 14
16. (switch_off instrument7 satellite2)
   deleted: (power_on instrument7)
   added: (power_avail satellite2)
   goals met: 8 of 14
17. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 8 of 14
18. (turn_to satellite0 star4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star4)
   goals met: 9 of 14
19. (turn_to satellite2 groundstation5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation5)
   goals met: 9 of 14
20. (calibrate satellite2 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 9 of 14
21. (turn_to satellite2 phenomenon9 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 phenomenon9)
   goals met: 9 of 14
22. (take_image satellite2 phenomenon9 instrument5 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 10 of 14
23. (turn_to satellite2 planet14 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet14)
   goals met: 10 of 14
24. (take_image satellite2 planet14 instrument5 spectrograph4)
   added: (have_image planet14 spectrograph4)
   goals met: 11 of 14
25. (turn_to satellite2 planet7 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet7)
   goals met: 11 of 14
26. (take_image satellite2 planet7 instrument5 image2)
   added: (have_image planet7 image2)
   goals met: 12 of 14
27. (take_image satellite2 planet7 instrument5 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 13 of 14
28. (turn_to satellite2 planet8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet8)
   goals met: 13 of 14
29. (take_image satellite2 planet8 instrument5 image2)
   added: (have_image planet8 image2)
   goals met: 14 of 14
